# -*- mode: ruby -*-

# frozen_string_literal: true

# taps
tap "aws/tap"
tap "borkdude/brew"
tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "teamookla/speedtest"
tap "turbot/tap"

# packages #
brew "apache-spark"
brew "aspell"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "bat" # cat with wings
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "bun"
brew "clojure-lsp"
brew "clojure/tools/clojure"
brew "cmake"
brew "coreutils"
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@31", args: ["with-debug", "with-mailutils", "with-xwidgets"]
brew "direnv"
brew "dog" # dns lookup
brew "exercism"
brew "fd"
brew "figlet" # ascii art in terminal
brew "fish"
brew "gcc"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "glib"
brew "gnupg", link: false
brew "gnutls"
brew "go"
brew "gping"
brew "gradle"
brew "graphviz"
brew "grep"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "helm"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "janet" # janet-lang, like clojure
brew "jq"
brew "kafka"
brew "kubectx"
brew "languagetool"
brew "lapack" # linear algebra
brew "leiningen"
brew "libgccjit" # for compiling emacs
brew "libheif"
brew "libproxy"
brew "libraw"
brew "librdkafka"
brew "librsvg"
brew "libssh2"
brew "llvm"
brew "lolcat" # colour in terminal
brew "lsd"
brew "luv" # libuv bindings for lua
brew "mailutils"
brew "markdown"
brew "maven"
brew "mermaid-cli"
brew "neovim"
brew "node"
brew "oauth2l"
brew "openblas"
brew "p11-kit"
brew "pango" # text rendering
brew "pkg-config"
brew "plantuml"
brew "podman"
brew "poetry"
brew "poppler" # pdf rendering lib
brew "procs"
brew "pstree"
brew "rbenv"
brew "ripgrep"
brew "roswell" # lisp environment manager
brew "ruby-build"
brew "ruff"
brew "rustup-init"
brew "sbcl"
brew "sbt"
brew "scala"
brew "sdkman-cli"
brew "shared-mime-info"
brew "starship"
brew "structurizr-cli"
brew "teamookla/speedtest/speedtest"
brew "terracognita"
brew "terraform-docs"
brew "terraform-ls"
brew "texinfo" # for emacs info pages
brew "tfenv" # terraform version manager
brew "tfsec" # terraform security scanner
brew "tig" # ncurses-based git client
brew "tldr" # simplified man page
brew "tree" # enhanced ls command
brew "tree-sitter" # incremental parsing system
brew "turbot/tap/steampipe" # cloud data query tool
brew "unbound" # recursive DNS resolver
brew "uv" # python package and project manager
brew "vale" # prose linter
brew "wget" # network downloader
brew "yarn" # node package manager
brew "zellij" # terminal workspace manager
brew "zlib" # compression lib
brew "zoxide" # smarter cd command

# casks #

# set arguments for all "brew cask " commands
cask_args appdir: "/Applications", require_sha: true

cask "alacritty"
cask "authy"
cask "canva"
cask "confluent-cli"
cask "dashlane"
cask "dbeaver-community"
cask "docker"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "flutter"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gitter"
cask "google-chrome",  args: { require_sha: false }
cask "google-drive",  args: { require_sha: false }
cask "gpg-suite"
cask "intellij-idea-ce"
cask "jprofiler"
cask "keybase"
cask "mactex"
cask "slack"
cask "spotify"
cask "todoist"
cask "virtualbox"
cask "visual-studio-code"
cask "zed"
