# -*- mode: ruby -*-

frozen_string_literal: true

# taps
tap "aws/tap"
tap "borkdude/brew"
tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "dbt-labs/dbt"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
tap "turbot/tap"

# packages #
brew "aspell"
brew "autoconf"
brew "automake"
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "bat"
brew "boot-clj"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "clojure-lsp"
brew "clojure/tools/clojure"
brew "cmake"
brew "coreutils"
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-debug", "with-mailutils", "with-modern-icon", "with-native-comp", "with-xwidgets"]
brew "dbt-labs/dbt/dbt", link: false
brew "deno"
brew "direnv"
brew "docker", link: false
brew "dog"
brew "elvish"
brew "exercism"
brew "fd"
brew "figlet"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "glances"
brew "glib"
brew "gnupg", link: false
brew "gnutls"
brew "go"
brew "gping"
brew "gradle"
brew "graphviz"
brew "grep"
brew "gtk+3"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "helm"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "imagemagick@6"
brew "jabba"
brew "janet"
brew "jq"
brew "kafka"
brew "krb5"
brew "kubectx"
brew "languagetool"
brew "lapack"
brew "leiningen"
brew "libgccjit"
brew "libheif"
brew "libproxy"
brew "libraw"
brew "librdkafka"
brew "librsvg"
brew "libssh2"
brew "llvm"
brew "lolcat"
brew "lsd"
brew "luv"
brew "mailutils"
brew "markdown"
brew "maven"
brew "mermaid-cli"
brew "mysql"
brew "neovim"
brew "nghttp2"
brew "node"
brew "oauth2l"
brew "openblas"
brew "openjdk@8"
brew "p11-kit"
brew "pango"
brew "pkg-config"
brew "plantuml"
brew "podman"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "procs"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.8"
brew "qt"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "roswell"
brew "rover"
brew "ruby-build"
brew "rust"
brew "rustup-init"
brew "sbcl"
brew "sbt"
brew "scala"
brew "shared-mime-info"
brew "sift"
brew "starship"
brew "structurizr-cli"
brew "teamookla/speedtest/speedtest"
brew "terracognita"
brew "terraform-docs"
brew "terraform-ls"
brew "texinfo"
brew "tfenv"
brew "tfsec"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "turbot/tap/steampipe"
brew "unbound"
brew "vale"
brew "wget"
brew "yarn"
brew "zlib"
brew "zoxide"

# casks #

# set arguments for all "brew cask " commands
cask_args appdir: "~/Applications", require_sha: true

cask "alacritty"
cask "alfred"
cask "atom"
cask "authy"
cask "canva"
cask "confluent-cli"
cask "dashlane"
cask "dbeaver-community"
cask "docker"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "flutter"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gitter"
cask "google-chrome",  args: { require_sha: false }
cask "google-drive",  args: { require_sha: false }
cask "gpg-suite"
cask "jprofiler"
cask "keybase"
cask "kitty"
cask "mactex"
cask "miro"
cask "pdf-expert"
cask "postman"
cask "skype"
cask "slack"
cask "spotify"
cask "todoist"
cask "virtualbox"
cask "visual-studio-code"
