# -*- mode: ruby -*-

# frozen_string_literal: true

# taps
tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# set arguments for all "brew cask " commands
cask_args appdir: "~/Applications", require_sha: true

# packages #
brew "ag"
brew "aspell"
brew "awscli"
brew "boot-clj"
brew "bat"
brew "clojure-lsp"
brew "clojure/tools/clojure"
brew "cmake"
brew "coreutils"
brew "coursier/formulas/coursier"
brew "deno"
brew "direnv"
brew "dog"
brew "emacs-plus@28", args: ["with-debug", "with-mailutils", "with-modern-icon", "with-native-comp", "with-xwidgets"]
brew "fd"
brew "fish"
brew "git"
brew "git-delta"
brew "gnutls"
brew "golang"
brew "gpg"
brew "gradle"
brew "grep"
brew "guile"
brew "htop"
brew "httpie"
brew "jenv"
brew "jq"
brew "languagetool"
brew "leiningen"
brew "llvm"
brew "lsd"
brew "mvn"
brew "markdown"
brew "neovim"
brew "nodejs"
brew "plantuml"
brew "pstree"
brew "pt"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-build"
brew "rustup-init"
brew "sbcl"
brew "sbt"
brew "scala"
brew "sift"
brew "starship"
brew "terraform-ls"
brew "tfenv"
brew "tfsec"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zoxide"

# casks #
cask "alacritty"
cask "alfred"
cask "atom"
cask "authy"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gitter"
cask "google-chrome",  args: { require_sha: false }
cask "google-drive",  args: { require_sha: false }
cask "jprofiler"
cask "keybase"
cask "mactex"
cask "postman"
cask "skype"
cask "slack"
cask "spotify"
cask "virtualbox"
cask "visual-studio-code"
